'use strict';

var MorphemeAlias = {

	// 체언
	'명사': 'NN',
	'일반명사': 'NNG',
	'고유명사': 'NNP',
	'의존명사': 'NNB',
	'대명사': 'NP',
	'수사': 'NR',

	// 용언
	'동사': 'VV',
	'형용사': 'VA',
	'보조용언': 'VX',
	'지정사': 'VC',
	'긍정지정사': 'VCP',
	'부정지정사': 'VCN',

	// 수식언
	'관형사': 'MM',
	'부사': 'MA',
	'일반부사': 'MAG',
	'접속부사': 'MAJ',

	// 독립언
	'감탄사': 'IC',

	// 관계언
	'격조사': 'JK',
	'주격조사': 'JKS',
	'보격조사': 'JKC',
	'관형격조사': 'JKG',
	'목적격조사': 'JKO',
	'부사격조사': 'JKB',
	'호격조사': 'JKV',
	'인용격조사': 'JKQ',
	'보조사': 'JX',
	'접속조사': 'JC',

	// 의존형태
	'어미': 'E',
	'선어말어미': 'EP',
	'종결어미': 'EF',
	'연결어미': 'EC',
	'명사형전성어미': 'ETN',
	'관형형전성어미': 'ETM',
	'접두사': 'XP',
	'체언접두사': 'XPN',
	'접미사': 'XS',
	'명사파생접미사': 'XSN',
	'동사파생접미사': 'XSV',
	'형용사파생접미사': 'XSA',
	'부사파생접미사': 'XSB',
	'어근': 'XR',

	// 기호
	'마침표/물음표/느낌표': 'SF',
	'마침표': 'SF',
	'물음표': 'SF',
	'느낌표': 'SF',
	'쉼표/가운뎃점/콜론/빗금': 'SP',
	'쉼표': 'SP',
	'가운뎃점': 'SP',
	'콜론': 'SP',
	'빗금': 'SP',
	'따옴표/괄호표/줄표': 'SS',
	'따옴표': 'SS',
	'괄호표': 'SS',
	'줄표': 'SS',
	'줄임표': 'SE',
	'붙임표(물결/숨김/빠짐)': 'SO',
	'붙임표': 'SO',
	'물결': 'SO',
	'숨김': 'SO',
	'빠짐': 'SO',
	'외국어': 'SL',
	'한자': 'SH',
	'기타기호(논리수학기호/화폐기호)': 'SW',
	'기타기호': 'SW',
	'논리수학기호': 'SW',
	'화폐기호': 'SW',
	'명사추정범주': 'NF',
	'용언추정범주': 'NV',
	'숫자': 'SN',
	'분석불능범주': 'NA',

	// 체언
	'ㅜㅜ': 'NN',
	'ㅜㅜㅎ': 'NNG',
	'ㅜㅞ': 'NNP',
	'ㅜㅜㅔ': 'NNP',
	'ㅜㅜㅠ': 'NNB',
	'ㅞ': 'NP',
	'ㅜㅔ': 'NP',
	'ㅜㄱ': 'NR',

	// 용언
	'ㅍㅍ': 'VV',
	'ㅍㅁ': 'VA',
	'ㅍㅌ': 'VX',
	'ㅍㅊ': 'VC',
	'ㅍ체': 'VCP',
	'ㅍㅊㅔ': 'VCP',
	'ㅍ추': 'VCN',
	'ㅍㅊㅜ': 'VCN',

	// 수식언
	'ㅡㅡ': 'MM',
	'ㅡㅁ': 'MA',
	'ㅡㅁㅎ': 'MAG',
	'ㅡ머': 'MAJ',
	'ㅡㅁㅓ': 'MAJ',

	// 독립언
	'ㅑㅊ': 'IC',

	// 관계언
	'ㅓㅏ': 'JK',
	'ㅓㅏㄴ': 'JKS',
	'ㅓㅏㅊ': 'JKC',
	'ㅓㅏㅎ': 'JKG',
	'ㅓㅏㅐ': 'JKO',
	'ㅓㅏㅠ': 'JKB',
	'ㅓㅏㅍ': 'JKV',
	'ㅓㅏㅂ': 'JKQ',
	'ㅓㅌ': 'JX',
	'ㅓㅊ': 'JC',

	// 의존형태
	'ㄷ': 'E',
	'데': 'EP',
	'ㄷㅔ': 'EP',
	'ㄷㄹ': 'EF',
	'ㄷㅊ': 'EC',
	'ㄷ수': 'ETN',
	'ㄷㅅㅜ': 'ETN',
	'ㄷ스': 'ETM',
	'ㄷㅅㅡ': 'ETM',
	'테': 'XP',
	'ㅌㅔ': 'XP',
	'테ㅜ': 'XPN',
	'ㅌㅔㅜ': 'XPN',
	'ㅌㄴ': 'XS',
	'ㅌ누': 'XSN',
	'ㅌㄴㅜ': 'XSN',
	'ㅌㄴㅍ': 'XSV',
	'ㅌㄴㅁ': 'XSA',
	'ㅌ뉴': 'XSB',
	'ㅌㄴㅠ': 'XSB',
	'ㅌㄱ': 'XR',

	// 기호
	'ㄴㄹ': 'SF',
	'네': 'SP',
	'ㄴㅔ': 'SP',
	'ㄴㄴ': 'SS',
	'ㄴㄷ': 'SE',
	'내': 'SO',
	'ㄴㅐ': 'SO',
	'니': 'SL',
	'ㄴㅣ': 'SL',
	'노': 'SH',
	'ㄴㅗ': 'SH',
	'ㄴㅈ': 'SW',
	'ㅜㄹ': 'NF',
	'ㅜㅍ': 'NV',
	'누': 'SN',
	'ㄴㅜ': 'SN',
	'ㅜㅁ': 'NA',

};

module.exports = MorphemeAlias;
